

mail_body_mashlim = """נראה כי קיימות הזמנות משלימים שאינן תקינות מבחינת בחירת המעצבת.
בכל הזמנת משלימים יש או לבחור מעצבת משלימים או מעצבת מוחרגת שנמצאת כמעצבת ראשית בתהליך מכירה.

במידה ורוצים להחריג את ההזמנה ממעצבות הסניף יש לשים את מנהלת הסניף כמעצבת בהזמנה.

להלן רשימת הזמנות משלימים בסניף שעבורן לא נבחרה מעצבת מוחרגת או מעצבת משלימים או מנהלת הסניף.
נא לסדר אותן, הזמנות שמוגדרות באופן לא תקין עלולות להשפיע על תהליכי שכר, דוחות למדידת הסניף ועוד.
"""


mail_body_old_supplydate = """
נראה כי קיימות הזמנות שדורשות טיוב תאריך אספקה משוער.
להלן רשימת הזמנות שתאריך האספקה המשוער שלהן נמצא בטווח קטן מארבע שבועות מהיום למרות שההזמנה אינה התקדמה לייצור.
 יש להיכנס להזמנות, לבדוק את מצבן ולעדכן את תאריך אספקה המשוער.
 במידה והתיק אינו מתקדם לייצור יש להגדיר תאריך אספקה משוער עתידי שהינו לפחות שלושה חודשים משבוע נוכחי.
"""

mail_body_upcoming_supplydate = """
נראה כי קיימות הזמנות שתאריך האספקה המשוער שלהן מתקרב לתאריך היעד עבור  כניסה לסריה.
יש לבחון האם אכן מדובר על תיקים שצריכים להכנס לסריה או האם נדרש לדחות תאריך אספקה משוער לתאריך עתידי.
במידה וכן רוצים לשריין מקום בסריה יש להתקדם עם המשימות הרלוונטיות כדי שיתאפשר אישור תקן.
"""

mail_body_task_alef = """
שלום.

מצורפת רשימה של תוכניות סופיות (תוכנית א') שנסרקו להזמנות ביממה האחרונה.
נא לעבור עליהם היום / מחר ולבדוק אותן שהן תואמות לתכנית אותה הלקוח אישר.
במידה וישנם שאלות / נדרשים שינויים יש לפנות לאחראי התיק במשרד טכני באופן מיידי(!)
"""
